In [37]:
import pandas as pd

data = pd.read_csv('movies.txt', names = ['movie_id', 'movie_name', 'movie_release_year', 'movie_rating', 'movie_duration_in_second'],encoding = 'latin-1', header = None)
data.head()

,movie_id,movie_name,movie_release_year,movie_rating,movie_duration_in_second
0,1,The Nightmare Before Christmas,1993,3.9,4568.0
1,2,The Mummy,1932,3.5,4388.0
2,3,Orphans of the Storm,1921,3.2,9062.0
3,4,The Object of Beauty,1991,2.8,6150.0
4,5,Night Tide,1963,2.8,5126.0

In [38]:
movie = data.movie_name
len(movie)

49590

## Find the number of movies released between 1950 and 1960.

In [45]:
movie_bt_1950_and_1960 = data[(data.movie_release_year >= 1950) & (data.movie_release_year <= 1960)]
print('total =',len(movie_bt_1950_and_1960))
movie_bt_1950_and_1960.head()

total = 547

,movie_id,movie_name,movie_release_year,movie_rating,movie_duration_in_second
70,71,All About Eve,1950,3.8,8300.0
93,94,House on Haunted Hill,1959,3.6,4491.0
97,98,Godzilla: King of the Monsters,1956,3.5,4828.0
99,100,High Noon,1952,3.9,5087.0
315,316,Beneath the 12-Mile Reef,1953,3.2,6036.0

## Find the number of movies having rating more than 4.

In [48]:
movie_rating_more_than_4 = data[data.movie_rating > 4]
print('total =',len(movie_rating_more_than_4))
movie_rating_more_than_4.head()

total = 897

,movie_id,movie_name,movie_release_year,movie_rating,movie_duration_in_second
138,139,Pulp Fiction,1994,4.1,9265.0
287,288,Life Is Beautiful,1997,4.2,6973.0
302,303,Mulan: Special Edition,1998,4.2,5270.0
464,465,Forrest Gump,1994,4.3,8525.0
490,491,Braveheart,1995,4.2,10658.0

## Find the movies whose rating are between 3 and 4

In [49]:
movie_rating_bt_3_and_4 = data[(data.movie_rating >= 3) & (data.movie_rating <= 4)]
print('total =',len(movie_rating_bt_3_and_4))
movie_rating_bt_3_and_4.head()

total = 8222

,movie_id,movie_name,movie_release_year,movie_rating,movie_duration_in_second
0,1,The Nightmare Before Christmas,1993,3.9,4568.0
1,2,The Mummy,1932,3.5,4388.0
2,3,Orphans of the Storm,1921,3.2,9062.0
5,6,One Magic Christmas,1985,3.8,5333.0
6,7,Muriel's Wedding,1994,3.5,6323.0

## Find the number of movies with duration more than 2 hours (7200 second).

In [50]:
movie_more_than_2_hour = data[(data.movie_duration_in_second > 7200)]
print('total =',len(movie_more_than_2_hour))
movie_more_than_2_hour.head()

total = 641

,movie_id,movie_name,movie_release_year,movie_rating,movie_duration_in_second
2,3,Orphans of the Storm,1921,3.2,9062.0
12,13,The Birth of a Nation,1915,2.9,12118.0
13,14,The Boys from Brazil,1978,3.6,7417.0
20,21,Born on the Fourth of July,1989,3.4,8646.0
21,22,Broadcast News,1987,3.4,7940.0

## Find the list of years and number of movies released each year.

In [52]:
list_of_years_and_movies_each_year = data.iloc[:, 2]
list_of_years_and_movies_each_year.value_counts()

2011    5511
2010    5107
2009    4451
2012    4339
2008    3358
2007    2892
2006    2416
2005    1937
2003    1399
2004    1381
1999    1181
2001    1173
2002    1117
2013     981
2000     902
1998     843
1997     788
1996     688
1995     592
1993     564
1994     517
1992     479
1990     470
1989     421
1991     364
1988     334
1985     334
1984     303
1986     287
1987     280
        ...
1949       9
1934       8
1943       7
1936       7
1933       7
1941       7
1939       6
1946       6
1920       6
1938       5
1925       5
1930       5
1924       5
1929       5
1927       4
1937       4
1923       4
1932       4
1931       3
1913       3
1919       3
1942       3
1926       2
1922       2
1928       2
1921       2
1918       1
1916       1
1915       1
2014       1
Name: movie_release_year, Length: 101, dtype: int64

## Find the total number of movies in the dataset

In [55]:
print('total_movie =', len(data))

total_movie = 49590